fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда) 
	
	ДлительнаяОперация = СоздатьАктыНаСервере();  
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.Заголовок = "Операция выполняется";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция СоздатьАктыНаСервере() 
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	"ВКМ_МассовоеСозданиеРеализаций.ВыполнитьСозданиеРеализаций", Объект.Период);
	
	Возврат Результат; 
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если МассивДокументов = Неопределено Тогда
		ТекстСообщения = "Все реализации за указанный период уже созданы";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Объект.СозданныеДокументы.Очистить();
	
	Для Каждого Документ Из МассивДокументов Цикл
		НоваяСтрока = Объект.СозданныеДокументы.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.Ссылка = Документ.Ссылка;
		НоваяСтрока.Статус = Документ.Статус;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры 

#КонецОбласти
